app/views/main/inventories.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <h1>Inventories</h1>
    <% x = User.where(id: @u).first%>