app/controllers/inventories_controller.rb

  def create
    @inventory = Inventory.new(inventory_params)

    respond_to do |format|
      if @inventory.save
---
INSERT INTO "inventories" ("user_id", "item_id", "price", "timestamp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["item_id", 5], ["price", 200.0], ["timestamp", "2022-11-02 12:30:00"], ["created_at", "2022-11-02 08:58:00.282141"], ["updated_at", "2022-11-02 08:58:00.282141"]]