app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "price", "stock", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "x5"], ["price", 2000.0], ["stock", 3], ["user_id", 1], ["created_at", "2022-11-02 15:16:32.177953"], ["updated_at", "2022-11-02 15:16:32.177953"]]

  def update
    if(session[:status] == "item")
      url = item_url(@item)
    else
      url = main_user_item_path
    end
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "user_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["user_id", 2], ["updated_at", "2022-11-01 17:19:51.460001"], ["id", 2]]