app/controllers/main_controller.rb

  def create
    u = User.where(login: params[:login]).first
---
SELECT "users".* FROM "users" WHERE "users"."login" = ? ORDER BY "users"."id" ASC LIMIT ?  [["login", "cqec"], ["LIMIT", 1]]

  def user_item
    session[:status] = 'user_item'
    session[:EditOrNew] = "edit"
    if !session[:logged_in]
      redirect_to main_login_path
    else
      @u = User.where(id: session[:id]).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def shop
    @u = User.where(id: params[:id]).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def buy
    x = Item.where(id: params[:item_id]).first
    if(session[:id] == params[:user_id])
      redirect_to action: "shop", id: params[:user_id] , notice: 'you are the seller on this items'
    end
    if(x.stock > 0)
      x.stock -= 1
      x.save()
      u = Inventory.new
      u.user_id = session[:id]
      u.item_id = params[:item_id]
      u.price = params[:item_price]
      u.timestamp = DateTime.now
      u.save()
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "items" SET "stock" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["stock", 2], ["updated_at", "2022-11-02 13:42:18.978131"], ["id", 3]]
INSERT INTO "inventories" ("user_id", "item_id", "price", "timestamp", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["item_id", 3], ["price", 155.5], ["timestamp", "2022-11-02 13:42:18.983152"], ["created_at", "2022-11-02 13:42:18.986659"], ["updated_at", "2022-11-02 13:42:18.986659"]]